t=-0.1:.001:0.1;%Το διάστημα του χρόνου του σήματος που ζητείται και το βήμα αυτού .001 sec)
Ts=0.002;%θέτουμε Τs=0.002 sec
N1=-50:1:50;
z=cos(100*pi*t)+ cos(200*pi*t)+sin(500*pi*t);%Το δεδομένο σήμα
Xs=cos(100*pi*N1*Ts)+cos(200*pi*N1*Ts)+sin(500*pi*N1*Ts);%Το νέο σήμα με τη συχνότητα δειγματοληψίας που βρήκαμε στο Γ.1.1
for k=1:1:length(t)
    x1(k)=Xs*sinc((t(k)-N1*Ts)/Ts)';
end;
figure('Name','Ανακατασκευασμένο Σήμα για Ts=0.002');
hold on;
%Εμφάνιση σημάτων:
plot(t,z);%Εμφάνιση του σήματος Γ.1.2
plot(t,x1,'-r');%Εμφάνιση του σήματος Γ.1.3 με υπέρθεση στο Γ.1.2
legend('Xs(t)');
legend('y(t)');
TITLE ('Γ.1.3');
xlabel('Χρόνος');
ylabel('Εύρος x1(t)');
grid on;
