t=-0.1:.001:0.1;%Το διάστημα του χρόνου του σήματος που ζητείται και το βήμα αυτού .001 sec)
z=cos(100*pi*t)+ cos(200*pi*t)+sin(500*pi*t);%Το δεδομένο σήμα

Ts1=0.002;%θέτουμε Τs1=0.002 sec
N1=-50:1:50;
Xs1=cos(100*pi*N1*Ts1)+cos(200*pi*N1*Ts1)+sin(500*pi*N1*Ts1);%Το νέο σήμα με συχνότητα δειγματοληψίας αυτήν που βρήκαμε στο Γ.1.1
Ts2=0.0001;%Βάζουμε μεγαλύτερη συχνότητα για να πάρουμε μικρότερη περίοδο:f=10000 Hz
N2=-1000:1:1000;
Xs2=cos(100*pi*N2*Ts2)+cos(200*pi*N2*Ts2)+sin(500*pi*N2*Ts2);
for k=1:1:length(t)
    x1(k)=Xs1*sinc((t(k)-N1*Ts1)/Ts1)';
end;

for k=1:1:length(t)
   x2(k)=Xs2*sinc((t(k)-N2*Ts2)/Ts2)';
end;


figure('Name','Ανακατασκευασμένο Σήμα για Ts=0.0001');
hold on;

%Εμφάνιση σημάτων:
plot(t,z);%Εμφάνιση του σήματος Γ.1.2
hold on;
plot(t,x1,'-r');%Εμφάνιση του σήματος Γ.1.3 
hold on;
plot(t,x2,'-g');%Εμφάνιση του σήματος Γ.1.4
legend('Xs(t)');
legend('y(t)');
TITLE ('Γ.1.4');
xlabel('Χρόνος');
ylabel('Εύρος x1(t)');
grid on;